In [1]:
# Importando biblioteca Pandas
import pandas as pd

In [2]:
# Leitura dos arquivos
df1 = pd.read_excel("/content/Datasets/Aracaju.xlsx")
df2 = pd.read_excel("/content/Datasets/Fortaleza.xlsx")
df3 = pd.read_excel("/content/Datasets/Natal.xlsx")
df4 = pd.read_excel("/content/Datasets/Recife.xlsx")
df5 = pd.read_excel("/content/Datasets/Salvador.xlsx")

In [3]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [4]:
df2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [5]:
df3.head()

  Cidade       Data  Vendas  LojaID  Qtde
0  Natal 2018-08-27   606.0     853     2
1  Natal 2018-11-25   563.0     853     2
2  Natal 2019-03-11   308.0     852     3
3  Natal 2019-01-07   271.0     854     3
4  Natal 2019-03-09   699.0     853     3

In [6]:
df4.head()

   Cidade       Data  Vendas  LojaID  Qtde
0  Recife 2019-01-01  162.61     981     1
1  Recife 2019-01-01   11.44     983     1
2  Recife 2019-02-10   12.94     983     5
3  Recife 2019-02-10  160.54     981     3
4  Recife 2019-02-14   19.89     983     7

In [7]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [10]:
# Juntando Todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [11]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [12]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [14]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
92   Fortaleza 2019-01-01    3.49    1005     4
76       Natal 2019-02-20  364.00     853     2
88    Salvador 2019-01-01   31.20    1036     1
45   Fortaleza 2019-01-01   39.63    1004     3
30      Recife 2019-01-01   12.35     980     5
85   Fortaleza 2019-01-01  149.00    1005     3
105     Recife 2019-01-01   41.12     980     3
209   Salvador 2019-01-02   69.98    1034     2
68    Salvador 2019-01-01  162.35    1037     3
25   Fortaleza 2019-01-01   80.31    1004     4

In [15]:
# Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [17]:
# Alterando o tipo de dado da colunas LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [18]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [19]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [20]:
# Valres faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [29]:
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [27]:
# Substituindo os valores nulos por Zero
df["Vendas"].fillna(0, inplace=True)

In [30]:
df["Vendas"].mean()

122.61180089485438

In [ ]:
# Apagando linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
# Apagando linhas com valores nulos com base em apenas 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
# Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

# Criando novas colunas

In [33]:
# Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [34]:
df.head(10)

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08
5  Aracaju 2018-01-01  156.20   1522     1   156.20
6  Aracaju 2018-01-01   35.50   1522     2    71.00
7  Aracaju 2019-01-01  172.22   1522     6  1033.32
8  Aracaju 2019-01-01   12.16   1523     1    12.16
9  Aracaju 2019-01-01  149.36   1523     3   448.08

In [35]:
# Criando a coluna Receita/Vendas = Qtde
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [36]:
df.head(10)

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0
5  Aracaju 2018-01-01  156.20   1522     1   156.20             1.0
6  Aracaju 2018-01-01   35.50   1522     2    71.00             2.0
7  Aracaju 2019-01-01  172.22   1522     6  1033.32             6.0
8  Aracaju 2019-01-01   12.16   1523     1    12.16             1.0
9  Aracaju 2019-01-01  149.36   1523     3   448.08             3.0

In [37]:
# Maior venda
df["Receita"].max()

3544.0

In [40]:
# Menor venda
df["Receita"].min()

3.34

In [41]:
# nlargest
df.nlargest(5, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0

In [42]:
# nsmallest
df.nsmallest(5, "Receita")

       Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118   Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65     Recife 2019-01-01    4.01    981     1     4.01             1.0
92      Natal 2019-01-02    4.57   1035     1     4.57             1.0
92   Salvador 2019-01-01    4.57   1035     1     4.57             1.0
95      Natal 2019-01-02    5.13   1035     1     5.13             1.0

In [43]:
# Agrupamento por Cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [44]:
# Ordenando o cojunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0